import React from "react";
import { useNavigate } from "react-router-dom";
import "../styles/about.css";

function Functions() {
    const navigate = useNavigate();
    return (
        <div className="about-container">
            <div className="about-card">
                <h1>Функции</h1>

                <p><strong>Простой, функциональный, доступный на всех устройствах</strong></p>
                <p>
                    DiaryApp — минималистичный инструмент, который всегда под рукой.  
                    Он создан, чтобы легко фиксировать 💡 идеи, важные заметки 💭, 
                    сфокусированно 🧠 работать над задачами и хранить личные мысли ❤️.
                </p>

                <h2>Основные возможности:</h2>
                <ul>
                    <li>➕ Добавление заметок</li>
                    <li>✏️ Редактирование заметок</li>
                    <li>🔍 Фильтрация записей по дате и содержанию</li>
                    <li>🗑️ Удаление ненужных записей</li>
                </ul>

                <button className="back-btn" onClick={() => navigate(-1)}>← Назад</button>
            </div>
        </div>
    );
}

export default Functions;
